{
	"articles": [
		{
	    	"title": "Blog redesign.",
	    	"text": "I've just updated design of my blog. What's been changed: header and footer styles, about page info and style.", 
	    	"date": "15.08.2016",
	    	"categories": [
	    		{
	    			"category-name": "Frontend,",
	    			"cat-link": "frontend"
	    		},
	    		{
	    			"category-name": "My life",
	    			"cat-link": "life"
	    		}
	    	],
	    	"article-link": "view.html#3",
	    	"id": 3
	    },
		{
	    	"title": "Django 1.10. First impressions.",
	    	"text": "A few days ago I started to learn Django framework. This framework helps to create web sites with hyper speed using python programming language (one of my favorite programming languages). I've already created a few web sites using django and I really like it. For example, to create a good blog using django you need to spend only 20-30 minutes and it's awesome. As for me django is better variant for backend development than php. It's fast and secure and I think that I'll use that framework as main as for backend development.", 
	    	"date": "15.08.2016",
	    	"categories": [
	    		{
	    			"category-name": "Backend",
	    			"cat-link": "backend"
	    		}
	    	],
	    	"article-link": "view.html#2",
	    	"id": 2
	    },
	    {
	    	"title": "My achievements in speedcubing [2016]",
	    	"text": "I do speedcubing from 2013 with big break from 2014 to 2016. Now my average time from one hundred solves of Rubic’s cube is 16.05 seconds. Somebody can say that it is bad time for 3 years, but considering my break it’s normal time. My best time is 9.8 seconds. I did it 2 months ago. Except Rubic’s cube I train other puzzles. My average time on 2×2 cube is 6.78, on 4×4 cube – 1:54.21 and my megaminx average time is 3:45.98. Today I’m organizer of speedcubing meetings in Kyiv. Every Sunday we go to the public places, solving puzzles and compete against each other. You can get more detail information about speedcubing meetings in Kyiv from my VK page.",
	    	"date": "12.08.2016",
	    	"categories": [
	        	{
	        		"category-name": "My life,",
	        		"cat-link" : "life"
	        	},
	        	{
	        		"category-name": "Speedcubing",
	        		"cat-link" : "speedcubing"
	        	}
	    	],
	    	"article-link": "view.html#1",
	    	"id": 1
	    }
	]
}
